# SegmentDrawnFromWrongSideError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..SegmentDrawnFromWrongSideError Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The segment is being drawn from the wrong side to connect to the location you indicated.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SegmentDrawnFromWrongSideError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SegmentDrawnFromWrongSideError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SegmentDrawnFromWrongSideError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace